In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
from numpy.random import randn

In [7]:
# from, import needed abstract names of libraries

In [8]:
sample = np.random.rand(101)

In [9]:
seed = np.random.seed(50)

In [11]:
np.random.rand(101)

array([0.46269203, 0.40821902, 0.48704348, 0.07051578, 0.58210861,
       0.9870218 , 0.20908846, 0.21237612, 0.96113505, 0.70695408,
       0.59296821, 0.38085241, 0.6387405 , 0.50242857, 0.08979307,
       0.29717467, 0.82814423, 0.17545597, 0.90448946, 0.58831483,
       0.01653446, 0.37002218, 0.0421295 , 0.12728055, 0.17926823,
       0.16645859, 0.8836885 , 0.90595205, 0.23540098, 0.40725992,
       0.47116016, 0.83023402, 0.29200762, 0.17382853, 0.45814311,
       0.90242916, 0.59493692, 0.41261333, 0.40565094, 0.30848417,
       0.31787873, 0.41508602, 0.63816707, 0.79526952, 0.03703341,
       0.7345411 , 0.77257086, 0.24442453, 0.98507686, 0.67500584,
       0.89276474, 0.2430547 , 0.05169588, 0.70974306, 0.95726431,
       0.02283522, 0.91314252, 0.72827371, 0.95540532, 0.27313545,
       0.17059351, 0.32260102, 0.27723846, 0.49060245, 0.13071575,
       0.73818374, 0.14032357, 0.57065071, 0.53333793, 0.23352304,
       0.47689405, 0.46474217, 0.8060311 , 0.01858511, 0.71281658,
       0.25099336, 0.66052656, 0.63644596, 0.05698766, 0.71890955,
       0.33992343, 0.54964287, 0.74431993, 0.17851274, 0.2507041 ,
       0.1338797 , 0.15077408, 0.93903034, 0.97145289, 0.14255659,
       0.19586501, 0.10039784, 0.08181247, 0.76837567, 0.21035674,
       0.46217645, 0.08401004, 0.33150228, 0.9883258 , 0.90027204,
       0.8653286 ])

In [13]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [14]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [15]:
# Dataframe is similar to View in Relational Databases

In [16]:
df['W']

A   -1.560352
B    1.411946
C   -1.282293
D    0.696737
E    3.314075
Name: W, dtype: float64

In [17]:
# Here df['W'] is a Series

In [19]:
df[['W','Y']]

          W         Y
A -1.560352 -0.620928
B  1.411946 -0.780469
C -1.282293  0.126338
D  0.696737 -0.997526
E  3.314075  0.123866

In [20]:
# Here ['W','Y'] is a List, which is passed as a key of dataframe

In [21]:
df[['W','X','Z']]

          W         X         Z
A -1.560352 -0.030978 -1.464580
B  1.411946 -0.476732  1.070268
C -1.282293 -1.327479  0.862194
D  0.696737 -0.334565  1.598908
E  3.314075  0.987770  0.742785

In [22]:
df.W

A   -1.560352
B    1.411946
C   -1.282293
D    0.696737
E    3.314075
Name: W, dtype: float64

In [24]:
# . operator is a shorthand and is not recommended to use here. It is also called SQL syntax

In [25]:
type(df['W'])

pandas.core.series.Series

In [26]:
# dataframe operations give dataframes as Series operations too except aggregation which gives out a value

In [27]:
df['new'] = df['Y'] + df['Z']

In [28]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.085509
B  1.411946 -0.476732 -0.780469  1.070268  0.289799
C -1.282293 -1.327479  0.126338  0.862194  0.988531
D  0.696737 -0.334565 -0.997526  1.598908  0.601382
E  3.314075  0.987770  0.123866  0.742785  0.866652

In [29]:
# Dataframes has two axis, x-axis or 0 and y-axis or 1. By default it is column wise or its default value is 1

In [31]:
df['new1'] = range(5)

In [32]:
df

          W         X         Y         Z       new  new1
A -1.560352 -0.030978 -0.620928 -1.464580 -2.085509     0
B  1.411946 -0.476732 -0.780469  1.070268  0.289799     1
C -1.282293 -1.327479  0.126338  0.862194  0.988531     2
D  0.696737 -0.334565 -0.997526  1.598908  0.601382     3
E  3.314075  0.987770  0.123866  0.742785  0.866652     4

In [34]:
df.drop('new', axis=1)

          W         X         Y         Z  new1
A -1.560352 -0.030978 -0.620928 -1.464580     0
B  1.411946 -0.476732 -0.780469  1.070268     1
C -1.282293 -1.327479  0.126338  0.862194     2
D  0.696737 -0.334565 -0.997526  1.598908     3
E  3.314075  0.987770  0.123866  0.742785     4

In [35]:
df

          W         X         Y         Z       new  new1
A -1.560352 -0.030978 -0.620928 -1.464580 -2.085509     0
B  1.411946 -0.476732 -0.780469  1.070268  0.289799     1
C -1.282293 -1.327479  0.126338  0.862194  0.988531     2
D  0.696737 -0.334565 -0.997526  1.598908  0.601382     3
E  3.314075  0.987770  0.123866  0.742785  0.866652     4

In [36]:
# drop function works bydefault on rows or x-axis or 0. Also df are all in-memory and they doesn't replicate themselves.
# so, inPlace = true will actually delete the column

In [37]:
df.drop('new', axis=1, inplace=True)

In [38]:
df.drop('new1', axis=1, inplace=True)

In [39]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [40]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [41]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [42]:
df.loc['A']

W   -1.560352
X   -0.030978
Y   -0.620928
Z   -1.464580
Name: A, dtype: float64

In [43]:
df.loc[['A','C']]

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
C -1.282293 -1.327479  0.126338  0.862194

In [44]:
df.iloc[2]

W   -1.282293
X   -1.327479
Y    0.126338
Z    0.862194
Name: C, dtype: float64

In [45]:
# ilocation gives index numbers to index names. here 0 means A, 1 means B, 2 means C and so on...

In [46]:
df.iloc[2]['W']

-1.282292595889517

In [47]:
df.loc[['A','C']]['X']

A   -0.030978
C   -1.327479
Name: X, dtype: float64

In [49]:
df.loc[['A','C']][['X','Z']]

          X         Z
A -0.030978 -1.464580
C -1.327479  0.862194

In [50]:
df.loc[['A','C'],['X','Z']]

          X         Z
A -0.030978 -1.464580
C -1.327479  0.862194

In [51]:
df.iloc[1,1]

-0.4767321434779508

In [52]:
df.loc['B','X']

-0.4767321434779508

In [53]:
df>1

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C  False  False  False  False
D  False  False  False   True
E   True  False  False  False

In [54]:
# Above is an example of Boolean Dataframe

In [55]:
type(df>1)

pandas.core.frame.DataFrame

In [56]:
df[df>1]

          W   X   Y         Z
A       NaN NaN NaN       NaN
B  1.411946 NaN NaN  1.070268
C       NaN NaN NaN       NaN
D       NaN NaN NaN  1.598908
E  3.314075 NaN NaN       NaN

In [61]:
df[df['W']>0]

          W         X         Y         Z
B  1.411946 -0.476732 -0.780469  1.070268
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [62]:
df[df['W']>0]['W']

B    1.411946
D    0.696737
E    3.314075
Name: W, dtype: float64

In [63]:
df[df['W']>0]['Z']

B    1.070268
D    1.598908
E    0.742785
Name: Z, dtype: float64

In [64]:
df[df['W']>0].iloc[2]

W    3.314075
X    0.987770
Y    0.123866
Z    0.742785
Name: E, dtype: float64

In [65]:
df[df.iloc[2]>0]

/home/akshatadmin/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [67]:
# Above is an error because type(df.loc[2]) is a Series and we need a List of columns or 
# dataframe inside dataframe. e.g. df[df['W']>0]

In [69]:
# Now we learn about multiple participation. AND and OR operations on dataframe

In [71]:
df[(df['W']>0.5) & (df['Y']>0)]

          W        X         Y         Z
E  3.314075  0.98777  0.123866  0.742785

In [72]:
df[(df['W']>0.5) | (df['Y']>0)]

          W         X         Y         Z
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [73]:
# python has and or instead of & |

In [74]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [75]:
# to create the index and create a column for existing index we use reset_index()

In [76]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.560352 -0.030978 -0.620928 -1.464580
1     B  1.411946 -0.476732 -0.780469  1.070268
2     C -1.282293 -1.327479  0.126338  0.862194
3     D  0.696737 -0.334565 -0.997526  1.598908
4     E  3.314075  0.987770  0.123866  0.742785

In [81]:
# Now df.iloc[2] can be passed in df as now index matching will occur. But df.loc['C'] will not occur again
# inPlace=True wil be needed to replace the existing df

In [82]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [83]:
new_ind = 'ab cd ef gh ij'.split()

In [84]:
new_ind

['ab', 'cd', 'ef', 'gh', 'ij']

In [85]:
df['new'] = new_ind

In [86]:
df

          W         X         Y         Z new
A -1.560352 -0.030978 -0.620928 -1.464580  ab
B  1.411946 -0.476732 -0.780469  1.070268  cd
C -1.282293 -1.327479  0.126338  0.862194  ef
D  0.696737 -0.334565 -0.997526  1.598908  gh
E  3.314075  0.987770  0.123866  0.742785  ij

In [88]:
df.set_index('new')

            W         X         Y         Z
new
ab  -1.560352 -0.030978 -0.620928 -1.464580
cd   1.411946 -0.476732 -0.780469  1.070268
ef  -1.282293 -1.327479  0.126338  0.862194
gh   0.696737 -0.334565 -0.997526  1.598908
ij   3.314075  0.987770  0.123866  0.742785

In [89]:
df.set_index('new', drop=False)

            W         X         Y         Z new
new
ab  -1.560352 -0.030978 -0.620928 -1.464580  ab
cd   1.411946 -0.476732 -0.780469  1.070268  cd
ef  -1.282293 -1.327479  0.126338  0.862194  ef
gh   0.696737 -0.334565 -0.997526  1.598908  gh
ij   3.314075  0.987770  0.123866  0.742785  ij

In [90]:
df.set_index('new', drop=False, append=True)

              W         X         Y         Z new
  new
A ab  -1.560352 -0.030978 -0.620928 -1.464580  ab
B cd   1.411946 -0.476732 -0.780469  1.070268  cd
C ef  -1.282293 -1.327479  0.126338  0.862194  ef
D gh   0.696737 -0.334565 -0.997526  1.598908  gh
E ij   3.314075  0.987770  0.123866  0.742785  ij

In [91]:
# Multi-Index and Index Hierarchy

In [92]:
l1=[1,2,3,4,5]
l2=[6,7,8,9,0]

In [93]:
list(zip(l1,l2))

[(1, 6), (2, 7), (3, 8), (4, 9), (5, 0)]

In [94]:
# zip works till shortest of a list

In [95]:
l1=[1,2,3,4,5]
l2=[6,7,8,9]

In [96]:
list(zip(l1,l2))

[(1, 6), (2, 7), (3, 8), (4, 9)]

In [97]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [98]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [99]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [100]:
df

             A         B
G1 1 -0.393956  0.148116
   2 -0.412234 -0.160715
   3  0.139531  0.285469
G2 1 -0.281262  1.710907
   2 -0.149767  0.690307
   3  1.095210  1.338409

In [101]:
# It can also be called as Data Grouping

In [102]:
outside1 = ['G1','G2','G1','G2','G2','G2']
inside1 = [1,2,3,1,2,3]
hier_index1 = list(zip(outside1,inside1))
hier_index1 = pd.MultiIndex.from_tuples(hier_index1)

In [103]:
hier_index1

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 1, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [104]:
df1 = pd.DataFrame(np.random.randn(6,2),index=hier_index1,columns=['A','B'])

In [105]:
df1

             A         B
G1 1 -1.368982  0.486428
G2 2  0.753522  0.363465
G1 3 -0.314710  1.373281
G2 1 -0.624417  0.375754
   2 -0.200416  0.743038
   3  0.857362 -1.506189

In [108]:
df1.loc['G2'].loc[2]

          A         B
2  0.753522  0.363465
2 -0.200416  0.743038

In [109]:
df.loc['G2'].loc[2]

A   -0.149767
B    0.690307
Name: 2, dtype: float64

In [110]:
df.index.names

FrozenList([None, None])

In [111]:
df.index.names = ['Group','Number']

In [112]:
df

                     A         B
Group Number
G1    1      -0.393956  0.148116
      2      -0.412234 -0.160715
      3       0.139531  0.285469
G2    1      -0.281262  1.710907
      2      -0.149767  0.690307
      3       1.095210  1.338409

In [118]:
# cross section = xs, works on rows, columns and indices also. By default axis is 0 or x-axis or Rows

In [116]:
df.xs('G1')

               A         B
Number
1      -0.393956  0.148116
2      -0.412234 -0.160715
3       0.139531  0.285469

In [117]:
df.xs(('G1',1))

A   -0.393956
B    0.148116
Name: (G1, 1), dtype: float64

In [119]:
df.xs(('G2',2))

A   -0.149767
B    0.690307
Name: (G2, 2), dtype: float64

In [120]:
df1.xs(('G2',2))

/home/akshatadmin/anaconda3/lib/python3.6/site-packages/ipykernel/zmqshell.py:537: PerformanceWarning: indexing past lexsort depth may impact performance.
  return super(ZMQInteractiveShell, self).run_cell(*args, **kwargs)

             A         B
G2 2  0.753522  0.363465
   2 -0.200416  0.743038

In [121]:
# We generally perform transformations on columns and data generations on rows

In [122]:
df.xs(['G2',2])

A   -0.149767
B    0.690307
Name: (G2, 2), dtype: float64

In [123]:
# Both tuple and list are acceptable here

In [125]:
df.xs(1, level='Number')

              A         B
Group
G1    -0.393956  0.148116
G2    -0.281262  1.710907